"""
1.
Задание: Поработайте с переменными, создайте несколько, выведите на экран.
"""
variable01 = 11
variable02 = 22
variable03 = 33
print ("Созданы переменные: ", variable01, ",", variable02,",", variable03)



"""
1.
Задание: Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""
user_name= str(input("Как вас зовут? "))
user_sername= str(input("Какая у вас фамилия? "))
user_age= int(input("Сколько вам полных лет? "))
user_number= int(input("Любое целое число: "))
print ("Здравствуйте, ", user_name, user_sername, ".", "Вам ", user_age, "полных лет.", "И вы выбрали число ", user_number, ".")
_____________________________
Введите перое число >>> 10
Введите второе число >>> 5
10+5=15
Введите ваше имя >>> Anna
Введите ваш возраст >>> 27
Привет, Anna! Тебе 27 лет.
    
